physicax-web/cfd/backend/uploads/e826d9637d/case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* Auto-generated blockMeshDict */
convertToMeters 1;

vertices
(
    (-3986.0215 -3983.9661 -3987.7076)
    (3987.1625 -3983.9661 -3987.7076)
    (3987.1625 3989.2180 -3987.7076)
    (-3986.0215 3989.2180 -3987.7076)
    (-3986.0215 -3983.9661 3985.4765)
    (3987.1625 -3983.9661 3985.4765)
    (3987.1625 3989.2180 3985.4765)
    (-3986.0215 3989.2180 3985.4765)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (29 35 19) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 7 4));
    }
    outlet
    {
        type patch;
        faces ((1 5 6 2));
    }
    bottom
    {
        type symmetryPlane;
        faces ((0 1 5 4));
    }
    top
    {
        type symmetryPlane;
        faces ((3 2 6 7));
    }
    front
    {
        type symmetryPlane;
        faces ((0 1 2 3));
    }
    back
    {
        type symmetryPlane;
        faces ((4 5 6 7));
    }
);

mergePatchPairs ();
