physicax-web/cfd/backend/uploads/e826d9637d/case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* Auto-generated U */
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (10000.0000 0.0000 0.0000);
boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (10000.0000 0.0000 0.0000);
    }
    outlet
    {
        type zeroGradient;
    }
    bottom
    {
        type symmetryPlane;
    }
    top
    {
        type symmetryPlane;
    }
    front
    {
        type symmetryPlane;
    }
    back
    {
        type symmetryPlane;
    }
    model
    {
        type noSlip;
    }
}
